CSI API ETABS v1

# cOAPIGetOAPIVersionNumber Method

---

Retrieves the API version number implemented by the GUI.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    double GetOAPIVersionNumber()

    Function GetOAPIVersionNumber As Double

    Dim instance As cOAPI
    Dim returnValue As Double

    returnValue = instance.GetOAPIVersionNumber()

    double GetOAPIVersionNumber()

    abstract GetOAPIVersionNumber : unit -> float

#### Return Value

Type: Double
Returns the API version number implemented by the GUI.

Remarks

See Also

#### Reference

cOAPI Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com